In [1]:
## 9.3
with open('accounts.txt', mode = 'w') as accounts:
    accounts.write('100 Jones 24.98\n')
    accounts.write('200 Doe 345.67\n')
    accounts.write('300 White 0.00\n')
    accounts.write('400 Stone -42.16\n')
    accounts.write('500 Rich 224.62\n')

In [2]:
## SC
with open('grades.txt', mode='w') as grades:
 grades.write('1 Red A\n')
 grades.write('2 Green B\n')
 grades.write('3 White A\n')

In [5]:
with open('accounts.txt', mode='r') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White           0.00
400       Stone         -42.16
500       Rich          224.62

In [9]:
## SC
with open('grades.txt', mode='r') as grades:
    print(f'{"ID":<10}{"Name":<10}{"Grade":>10}')
    for record in grades:
        ID, Name, Grade = record.split()
        print(f'{ID:<10}{Name:<10}{Grade:>10}')

ID        Name           Grade
1         Red                A
2         Green              B
3         White              A

In [10]:
## 9.4
accounts = open('accounts.txt', 'r')

In [23]:
temp_file = open('temp_file1.txt','w')

In [24]:
 with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account != '300':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Williams', balance])
            temp_file.write(new_record + '\n')

ValueError: I/O operation on closed file.

In [13]:
import os

In [14]:
os.remove('accounts.txt')

In [15]:
os.rename('temp_file.txt','accounts.txt')

In [30]:
## SC
temp_file = open('temp_file.txt','w')
accounts = open('accounts.txt','r')

In [31]:
with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account != 'Doe':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Smith', balance])
            temp_file.write(new_record + '\n')

In [32]:
os.remove('accounts.txt')

In [33]:
os.rename('temp_file.txt','accounts.txt')

In [1]:
## 9.5
accounts_dict = {'accounts': [
    {'account': 100, 'name': 'Jones', 'balance': 24.98},
    {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [2]:
accounts_dict

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [3]:
import json

In [4]:
with open('accounts.json','w') as accounts:
    json.dump(accounts_dict, accounts)

In [5]:
with open('accounts.json','r') as accounts:
    accounts_json = json.load(accounts)

In [6]:
accounts_json

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [7]:
accounts_json['accounts'][0]

{'account': 100, 'name': 'Jones', 'balance': 24.98}

In [8]:
accounts_json['accounts'][1]

{'account': 200, 'name': 'Doe', 'balance': 345.67}

In [9]:
with open('accounts.json', 'r') as accounts:
    print(json.dumps(json.load(accounts), indent=4))

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 200,
            "name": "Doe",
            "balance": 345.67
        }
    ]
}

In [11]:
## SC
grades_dict = {'gradebook':
 [{'student_id': 1, 'name': 'Red', 'grade': 'A'},
 {'student_id': 2, 'name': 'Green', 'grade': 'B'},
 {'student_id': 3, 'name': 'White', 'grade': 'A'}]}
with open('grades.json','w') as grades:
    json.dump(grades_dict, grades)

In [12]:
with open('grades.json','r') as grades:
    grades_json = json.load(grades)

In [13]:
with open('grades.json', 'r') as grades:
    print(json.dumps(json.load(grades), indent=4))

{
    "gradebook": [
        {
            "student_id": 1,
            "name": "Red",
            "grade": "A"
        },
        {
            "student_id": 2,
            "name": "Green",
            "grade": "B"
        },
        {
            "student_id": 3,
            "name": "White",
            "grade": "A"
        }
    ]
}

In [16]:
## 9.8
# dividebyzero.py
"""Simple exception handling example."""

while True:
    # attempt to convert and divide values
    try:
        number1 = int(input('Enter numerator: '))
        number2 = int(input('Enter denominator: '))
        result = number1 / number2
    except ValueError:  # tried to convert non-numeric value to int
        print('You must enter two integers\n')
    except ZeroDivisionError:  # denominator was 0
        print('Attempted to divide by zero\n')
    else:  # executes only if no exceptions occur
        print(f'{number1:.3f} / {number2:.3f} = {result:.3f}')
        break  # terminate the loop

Enter numerator:  5\0

You must enter two integers

Enter numerator:  0
Enter denominator:  0

Attempted to divide by zero

Enter numerator:  5
Enter denominator:  6

5.000 / 6.000 = 0.833

In [17]:
## 9.12 - CSVs

import csv

with open('accounts.csv', mode='w', newline='') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100, 'Jones', 24.98])
    writer.writerow([200, 'Doe', 345.67])
    writer.writerow([300, 'White', 0.00])
    writer.writerow([400, 'Stone', -42.16])
    writer.writerow([500, 'Rich', 224.62])

In [19]:
with open('accounts.csv', 'r', newline='') as accounts:
     print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
     reader = csv.reader(accounts)
     for record in reader:
         account, name, balance = record
         print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

In [21]:
## SC
with open('grades.csv', mode='w', newline='') as grades:
    writer = csv.writer(grades)
    writer.writerow([1, 'Red', 'A'])
    writer.writerow([2, 'Green', 'B'])
    writer.writerow([3, 'White', 'A'])

In [22]:
with open('grades.csv', 'r', newline='') as grades:
     print(f'{"ID":<10}{"Name":<10}{"Grade":>10}')
     reader = csv.reader(grades)
     for record in reader:
         ID, Name, Grade = record
         print(f'{ID:<10}{Name:<10}{Grade:>10}')

ID        Name           Grade
1         Red                A
2         Green              B
3         White              A

In [23]:
import pandas as pd

In [24]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

In [26]:
titanic

                           Unnamed: 0 survived     sex      age passengerClass
0       Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1      Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2        Allison, Miss. Helen Loraine       no  female   2.0000            1st
3     Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4     Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st
...                               ...      ...     ...      ...            ...
1304             Zabour, Miss. Hileni       no  female  14.5000            3rd
1305            Zabour, Miss. Thamine       no  female      NaN            3rd
1306        Zakarian, Mr. Mapriededer       no    male  26.5000            3rd
1307              Zakarian, Mr. Ortin       no    male  27.0000            3rd
1308               Zimmerman, Mr. Leo       no    male  29.0000            3rd

[1309 rows x 5 columns]

In [27]:
 pd.set_option('precision', 2)

In [28]:
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [29]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [31]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

In [32]:
titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

In [33]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [34]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [35]:
%matplotlib

Using matplotlib backend: Qt5Agg

In [36]:
histogram = titanic.hist()

In [37]:
## 17.2

In [47]:
import sqlite3

In [48]:
connection = sqlite3.connect('books.db')

In [49]:
import pandas as pd

In [50]:
pd.options.display.max_columns = 10

In [51]:
pd.read_sql('select * from authors', connection, index_col = ['id'])

DatabaseError: Execution failed on sql 'select * from authors': no such table: authors